import pytest

from src.services import search
from src.utils import excel_reader


@pytest.mark.parametrize(
    "to_find, expected",
    [
        (
            "РЖД",
            {
                "Дата операции": "29.12.2021 22:32:24",
                "Дата платежа": "30.12.2021",
                "Номер карты": "*4556",
                "Статус": "OK",
                "Сумма операции": -1411.4,
                "Валюта операции": "RUB",
                "Сумма платежа": -1411.4,
                "Валюта платежа": "RUB",
                "Кэшбэк": 70.0,
                "Категория": "Ж/д билеты",
                "MCC": 4112.0,
                "Описание": "РЖД",
                "Бонусы (включая кэшбэк)": 70,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 1411.4,
            },
        ),
        (
            "Ж/д билеты",
            {
                "Дата операции": "29.12.2021 22:32:24",
                "Дата платежа": "30.12.2021",
                "Номер карты": "*4556",
                "Статус": "OK",
                "Сумма операции": -1411.4,
                "Валюта операции": "RUB",
                "Сумма платежа": -1411.4,
                "Валюта платежа": "RUB",
                "Кэшбэк": 70.0,
                "Категория": "Ж/д билеты",
                "MCC": 4112.0,
                "Описание": "РЖД",
                "Бонусы (включая кэшбэк)": 70,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 1411.4,
            },
        ),
    ],
)
def test_search(to_find: str, expected: dict) -> None:
    """Тест простой поисковой строки"""
    assert search(excel_reader(r"C:\Users\User\PycharmProjects\Project1\data\operations.xlsx"), to_find)[0] == expected
    assert search(excel_reader("data/operations.xlsx"), "idk") == []
